app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["created_at", "2018-11-05 21:58:43.578763"], ["updated_at", "2018-11-05 21:58:43.578763"]]
---
    def create
      #render plain: params[:post].inspect
      @post = Post.new(postParams)

      @post.save